"""
    循环结构
    死循环--忘记在循环内部修改循环判断条件，导致循环持续执行
"""
# 程序计数是从0开始的
# i = 0                       # 初始化条件设置 -- 通常是重复执行的计数器
# while i < 5:              # while 条件（判断 计数器 是否到达 目标次数）
#     print("Hello Python")   # 条件满足时，做的事情
#
#     i += 1              # 判断条件（计数器+1）


"""
    赋值运算符
    c += a --- c = c + a  加法赋值
    c -= a --- c = c - a  减法赋值
    c *= a --- c = c * a  乘法赋值
    c /= a --- c = c / a  除法赋值
    c //= a --- c = c // a  取整除赋值
    c %= a --- c = c % a   取余赋值
    c ** = a --- c = c ** a 幂赋值

"""


# 练习二
# 计算0~100之间所有数字的累计求和结果

# 0.定义最终结果数
# result = 0
#
# # 1.定义一个整数变量记录循环的次数
# i = 0
#
# # 2.开始循环
# while i <= 100:
#     print(i)
#
#     # 每次循环，都让result这个变量和i这个计数器相加
#     result += i
#
#     # 处理计数器
#     i += 1
#
# print("0~100数字求和结果 = %d" % result)

# 练习三
# 求0~100数字之间偶数求和

result2 = 0

i = 0

while i <= 100:
    if i % 2 == 0:
        print(i)

        result2 += i

    i += 1

print("0~100偶数求和 = %d" % result2)